<?php

namespace app\componments\utils;


use yii\base\UserException;
//  ApiException::run(ResponseMap::Map('300001'),'300001',__CLASS__,__METHOD__,__LINE__);
class ResponseMap
{
    protected static $map = [


        //公共类
        '100001'=>'空值',
        '100002'=>'页码错误',
        '100003'=>'表记录不存在',
        '100004'=>'表记录已经存在',
        '100005'=>'非法字符',
        '100006'=>'微信配置错误',
        '100007'=>'验证码格式错误',
        '100008'=>'手机接收超出5条短信每天',
        '100009'=>'service参数缺失',
        '100010'=>'该服务不存在',
        '100011'=>'密码错误',
        '100012'=>'用户被禁用',
        '100013'=>'用户被删除',
        //登录类
        '200001'=>'商户不存在',
        '200002'=>'商户登录密码错误',
        '200003'=>'该微信已经绑定了一个帐号',
        '200004'=>'该用户已经绑定了微信帐号',
        '200005'=>'该帐号已封停,请联系客服人员',
        '200006'=>'该帐号已被暂停使用,请联系客服人员',
        //API接口类
        '300001'=>'access-token错误',

        '300003'=>'必传参数没有完全传入',
        '300004'=>'参数格式验证错误',

        //用户类
        '700001'=>'用户被禁用',
        '700002'=>'两次输入的密码不一致',
        '700003'=>'密码至少6位',
        '700004'=>'密码必须同时包含字母和数字',


        //用户组
        '710001'=>"后台用户组不存在",
        '710002'=>"后台用户组没权限调用该接口",
        '710003'=>"前台用户组不存在",
        '710004'=>"前台用户组没权限调用该接口",
        //
        '800001'=>"参数错误",



        '900001'=>'为系统错误',
        //资源请求大类
        //900001为系统错误
    ];

    public static function Map($code)
    {
        if(!array_key_exists($code,self::$map))
        {
            throw new UserException("业务码映射不存在","900001");
        }

        return self::$map[$code];
    }
}